'''
知识点1 ：元组复制列表的正确方式
'''
a = [1,2,3]
b = (4,5,6)
b = a                   # b是a的引用,修改a也会修改b的值
a[0] = 0
print(b)                # [0, 2, 3]
b = a[:]                # b正确复制a的方式
a[0] = 1
print(b)                # [0, 2, 3]

'''
知识点2：列表操作方法
'''
list0 = [1,0,1,1,1,4,5,6]
list0.extend([1,2])
print(list0)            #[4, 5, 6, 1, 2]
# 统计列表元素中元素1 出现的次数
count = list0.count(1)  #5
# 找出列表元素中第一个1 的索引位置
index = list0.index(1)

'''
知识点3:集合运算
'''
set0 = {1,2,2,3,5}        #自动去重,[1,2,3]
set1 = {0,1,3,4}
'''
(set0 | set1)         求并集
(set0 & set1)         求交集
(set0 - set1)         求差集，即再set0中不在set1中
(set0 ^ set1)         求对称差集，在set0和set1中，不会同时出现在两者中
'''
# {0, 1, 2, 3, 4, 5} {1, 3} {2, 5} {0, 2, 4, 5}
print((set0 | set1), (set0 & set1), (set0 - set1), (set0 ^ set1))